# HasValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColorEntry..::..HasValue Method
AnalysisDisplayColorEntry Class See Also
---
Check if color entry has associated value.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasValue()
```

Visual Basic
---
```text
Public Function HasValue As Boolean
```

Visual C++
---
```text
public:
bool HasValue()
```

# ### Return Value
True if entry has a value associated with it, false otherwise.
# See Also
AnalysisDisplayColorEntry Class
Autodesk.Revit.DB.Analysis Namespace